# pandas?
---

- panel data & python data analysis
- 고성능의, 사용하기 쉬운 자료 구조로, 데이터 분석을 할 수 있는 python library

# installation

In [1]:
import pandas as pd

# pandas data table representation
---

pandas 의 table 데이터 표현(구현) 은 `DataFrame` 을 통해서 이루어진다.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/01_table_dataframe1.svg)

여러가지 방법으로 `DataFrame` 을 생성할 수 있지만, 아래 예제에서는 python `dict` 로 생성

In [2]:
data = {
    "customer_id": [
        1,
        2,
        3
    ],
    "name": [
        "kim",
        "lee",
        "park",
    ],
    "age": [
        35,
        41,
        25,
    ],
}

df = pd.DataFrame(data)

In [3]:
df

   customer_id  name  age
0            1   kim   35
1            2   lee   41
2            3  park   25

# Each column in a `DataFrame` is a `Series`
---

`DataFrame` 은 `Series` 라는 열을 모아서 table 형태를 구현한다.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/01_table_series.svg)

위에서 만든 `df` 의 `age` 열만 선택하고 싶다면, 대괄호(`[]`) 안에 컬럼명을 넣어서 선택한다.  
이 과정은 마치 python `dict` 의 값을 `key` 로 선택하는 것과 매우 유사하다.

In [4]:
df["age"]

0    35
1    41
2    25
Name: age, dtype: int64

`Series` 를 따로 생성할 수 있다.

In [5]:
pd.Series(["pandas", "numpy", "pandas"], name="favorite_library")

0    pandas
1     numpy
2    pandas
Name: favorite_library, dtype: object

# Do something with a DataFrame or Series
---
`DataFrame` 이나 `Series` 를 이용하여 분석을 해보자!

주어진 데이터에서 가장 많은 나이(`age`)는 ?

In [6]:
df["age"].max()

41

아래와 같이 `Series` 에서 메서드를 사용할 수 도 있다.

In [7]:
pd.Series([1, 2, 3, 4, 5]).max()

5

# How do I read and write tabular data?
---

테이블(표)형식의 데이터를 읽고 써보자

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/02_io_readwrite1.svg)

`pandas` 에서는 `read_*` 로 시작하는 데이터 읽기 함수와 `to_*` 로 시작하는 데이터 쓰기 함수를 제공한다.  
우리에게 익숙한 `csv`, `excel` 뿐만 아니라 Database 를 읽고 쓰는 `sql` 까지 매우 다양한 기능이 있다.

우선 `read_csv` 함수를 이용하여 `csv` 파일을 읽어 보자

In [8]:
titanic = pd.read_csv(
    "https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/titanic.csv"
)

`DataFrame` 을 전체적으로 확인한다.

In [9]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

맨 위 5개의 행을 확인한다.

In [10]:
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

각 열에 대한 `dtype` 을 확인한다

In [11]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

현재 `DataFrame` 을 `excel` 로 저장하고 싶다면 `to_excel` 메서드를 사용하여 저장할 수 있다.

In [12]:
titanic.to_excel("titanic.xlsx")

# How do I select specific columns from a `DataFrame`?
---
`DataFrame` 에서 특정 열을 선택해보자

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/03_subset_columns.svg)

`Age` 열만 선택한다

In [13]:
titanic["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

`DataFrame` 에서 하나의 열을 선택한 결과는 `Series` 이다

In [14]:
type(titanic["Age"])

pandas.core.series.Series

`Age` 열과 `Name` 열을 선택한다

In [15]:
titanic[["Age", "Name"]]

      Age                                               Name
0    22.0                            Braund, Mr. Owen Harris
1    38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    26.0                             Heikkinen, Miss. Laina
3    35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4    35.0                           Allen, Mr. William Henry
..    ...                                                ...
886  27.0                              Montvila, Rev. Juozas
887  19.0                       Graham, Miss. Margaret Edith
888   NaN           Johnston, Miss. Catherine Helen "Carrie"
889  26.0                              Behr, Mr. Karl Howell
890  32.0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

`DataFrame` 에서 두개 이상의 열을 선택한 결과는 `DataFrame` 이다

In [16]:
type(titanic[["Age", "Name"]])

pandas.core.frame.DataFrame

# How do I filter specific rows from a `DataFrame`?
---
이제 특정 행을 필터링 하는 법을 알아보자

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/03_subset_rows.svg)

`Age` 열에서 35 세 이상인 행만 필터링한 `DataFrame` 을 구하는 방법은 아래와 같다.

`Age` 열의 값이 35세 이상인지 아닌지 조건식을 구한다.

In [17]:
is_35_or_more = titanic["Age"] >= 35

is_35_or_more.head(10) # 결과값이 False 이면 35세 미만, True 이면 35세 이상이다.

0    False
1     True
2    False
3     True
4     True
5    False
6     True
7    False
8    False
9    False
Name: Age, dtype: bool

`DataFrame` 을 담고 있는 변수의 `대괄호([])` 안 조건식(`is_35_or_more`)을 넣는다.

In [18]:
titanic[is_35_or_more]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

35세 이상이면서 여성인 승객을 구해보자

In [19]:
is_women = titanic["Sex"] == "female"

is_women.head(10)

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8     True
9     True
Name: Sex, dtype: bool

만약 2개 이상의 조건에 해당하는 행을 필터링하려면  
조건식을 각각 `and(&)` 또는 `or(|)` 로 연결하여 `[]` 안에 넣어주면 된다.

In [20]:
titanic[is_35_or_more & is_women]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

# How do I select specific rows and columns from a `DataFrame`?
---
이제 특정 조건에 해당하는 행과 열을 동시에 필터링 해보자.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/03_subset_columns_rows1.svg)

`Age` 가 35세 이상인 승객의 이름(`Name`)과 성별(`Sex`) 를 선택해보자.  
행과 열을 동시에 선택하기위해 `.loc` 연산자를 사용한다.

In [21]:
titanic.loc[is_35_or_more, ["Name", "Sex"]]

                                                  Name     Sex
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
6                              McCarthy, Mr. Timothy J    male
11                            Bonnell, Miss. Elizabeth  female
..                                                 ...     ...
865                           Bystrom, Mrs. (Karolina)  female
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female
873                        Vander Cruyssen, Mr. Victor    male
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female
885               Rice, Mrs. William (Margaret Norton)  female

[235 rows x 2 columns]

`.iloc` 연산자를 이용하여 python list slicing 처럼 특정 인덱스에 해당하는 행을 선택할 수 도 있다.

In [22]:
titanic.iloc[3:10]  # 3번째~10번째 전까지의 행을 선택

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

`NaN`(`na`) 는 데이터가 비어있음(`null`)을 나타내는 단어이다.  
`isna` 함수로 데이터가 `null` 인지 아닌지 여부를 확인할 수 있다.

In [23]:
is_na_age = titanic["Age"].isna()

is_na_age.head(10)

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: Age, dtype: bool

`loc` 과 `iloc` 으로 선택된 `DataFrame` 의 데이터를 수정/변경 할 수 있다.

`Age` 열의 값이 `NaN`(`null`) 인 행의 이름(`Name`)을 'anonymous' 로 변경한다.

In [24]:
titanic.loc[is_na_age, "Name"] = "anonymous"

In [25]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,anonymous,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# How to create new columns derived from existing columns?
---
`DataFrame` 에 기존에 있는 열을 수정/변경하여 새로운 열을 추가해보자

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/05_newcolumn_1.svg)

실습을 위해 세 고객의 시간별 전력사용 데이터를 불러온다.

In [26]:
electricity_usage = pd.read_csv(
    "https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/electricity_usage.csv",
    index_col=0,
    parse_dates=True
)

In [27]:
electricity_usage.head()

                     customer_a  customer_b  customer_c
datetime
2019-05-07 02:00:00         NaN         NaN        23.0
2019-05-07 03:00:00        50.5        25.0        19.0
2019-05-07 04:00:00        45.0        27.7        19.0
2019-05-07 05:00:00         NaN        50.4        16.0
2019-05-07 06:00:00         NaN        61.9         NaN

`customer_c` 의 전력사용 데이터가 오류로 인해 시간당 `2` 씩 적게 측정되었다고 한다. 이를 올바로 복구해보자.

In [28]:
electricity_usage["customer_c"] = electricity_usage["customer_c"] + 2

In [29]:
electricity_usage.head()

                     customer_a  customer_b  customer_c
datetime
2019-05-07 02:00:00         NaN         NaN        25.0
2019-05-07 03:00:00        50.5        25.0        21.0
2019-05-07 04:00:00        45.0        27.7        21.0
2019-05-07 05:00:00         NaN        50.4        18.0
2019-05-07 06:00:00         NaN        61.9         NaN

`customer_a` 와 `customer_b` 의 시간당 사용 비율을 구해보자.

![](https://gist.github.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/05_newcolumn_21.svg)

In [30]:
electricity_usage["customer_a_b_rate"] = electricity_usage["customer_a"] / electricity_usage["customer_b"]

In [31]:
electricity_usage.head(10)

                     customer_a  customer_b  customer_c  customer_a_b_rate
datetime
2019-05-07 02:00:00         NaN         NaN        25.0                NaN
2019-05-07 03:00:00        50.5        25.0        21.0           2.020000
2019-05-07 04:00:00        45.0        27.7        21.0           1.624549
2019-05-07 05:00:00         NaN        50.4        18.0                NaN
2019-05-07 06:00:00         NaN        61.9         NaN                NaN
2019-05-07 07:00:00         NaN        72.4        28.0                NaN
2019-05-07 08:00:00         NaN        77.7        34.0                NaN
2019-05-07 09:00:00         NaN        67.9        34.0                NaN
2019-05-07 10:00:00         NaN        56.0        30.0                NaN
2019-05-07 11:00:00         NaN        34.5        23.0                NaN

### Caution!
연산시 `for loop` 를 사용하는 것을 지양해야한다.  
대신 `pandas` 의 `verterized` 연산을 사용해야한다.

- 올바른 예  
```python
electricity_usage["customer_a"] * 3
```
- 잘못된 예
```python
result = []
for row in electricity_usage["customer_a"]:  
    result.append(row*3)
```

# How to calculate summary statistics?
---

`DataFrame` 에서 제공하는 메서드로 집계/통계 정보를 구해보자.

### Aggregating statistics
---
통계용 집계 연산을 이용해서 평균(`mean`), 중앙값(`median`) 등을 계산할 수 있다.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/06_aggregate.svg)

승객들의 나이(`Age`) 열의 평균(`mean`)을 구해보자.

In [32]:
titanic["Age"].mean()

29.69911764705882

나이(`Age`), 운임(`Fare`) 등 여러 행에 걸쳐서 중앙값(`median`)을 구해보자.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/06_reduction.svg)

In [33]:
titanic[["Age", "Fare"]].median()

Age     28.0000
Fare    14.4542
dtype: float64

### Aggregating statistics grouped by category
---
카테고리로 그룹지어 그룹의 통계정보를 계산할 수 있다.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/06_groupby1.svg)

성별(`Sex`) 그룹별로 모든 열에대해서 평균을 계산한다.

In [34]:
titanic.groupby("Sex").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

성별(`Sex`) 별로 그룹화한 후 나이(`Age`)의 평균을 선택한다.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/06_groupby_select_detail.svg)

In [35]:
titanic.groupby("Sex")["Age"].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

여러가지 그룹별로 통계를 계산할 수도 있다.

성별(`Sex`), 승객의 사회적/경제적 지위(`Pclass`) 별 운임(`Fare`)의 평균을 구한다.

In [36]:
titanic.groupby(["Sex", "Pclass"])["Fare"].mean()

Sex     Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

### Count number of records by category
---
카테고리별로 행의 수를 계산해보자.

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/06_valuecounts.svg)

승객수준(`Pclass`)별 승객수(행의 수)를 구한다.

In [37]:
titanic.groupby("Pclass").size()

Pclass
1    216
2    184
3    491
dtype: int64

# How to reshape the layout of tables?
---
테이블의 데이터 구조를 바꿔보자.

### Sort table rows
---
`DataFrame` 의 행들을 나이(`Age`)순으로 오름차순 정렬 한다.

In [38]:
titanic.sort_values(by="Age").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

승객수준(`Pclass`) 과 연령(`Age`)별 로 내림차순 정렬한다.

In [40]:
titanic.sort_values(by=["Pclass", "Age"], ascending=False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S

실습을 위해 도시별 이산화질소(`no2`)의 양을 측정한 데이터셋을 불러온다.

In [41]:
air_quality_long = pd.read_csv(
    "https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/air_quality_long.csv",
    index_col="date.utc",
    parse_dates=True
)

In [42]:
air_quality_long.head()

                                city country location parameter  value   unit
date.utc
2019-06-18 06:00:00+00:00  Antwerpen      BE  BETR801      pm25   18.0  µg/m³
2019-06-17 08:00:00+00:00  Antwerpen      BE  BETR801      pm25    6.5  µg/m³
2019-06-17 07:00:00+00:00  Antwerpen      BE  BETR801      pm25   18.5  µg/m³
2019-06-17 06:00:00+00:00  Antwerpen      BE  BETR801      pm25   16.0  µg/m³
2019-06-17 05:00:00+00:00  Antwerpen      BE  BETR801      pm25    7.5  µg/m³

`parameter` 열의 값이 `no2` 인 행만 필터링한다.

In [43]:
no2 = air_quality_long[air_quality_long["parameter"]=="no2"]

### Pivot
---
long to wide format(`pivot_table`) 에 대해서 알아보자!

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/07_pivot.svg)

`no2` `DataFrame` 의 `location` 별 `value` 를 알고 싶을땐,  
excel 의 `피벗 테이블` 기능과 동일하게 `DataFrame.pivot` 메서드를 사용한다.

In [44]:
no2.pivot(columns="location", values="value").head()

location                   BETR801  FR04014  London Westminster
date.utc
2019-04-09 01:00:00+00:00     22.5     24.4                 NaN
2019-04-09 02:00:00+00:00     53.5     27.4                67.0
2019-04-09 03:00:00+00:00     54.5     34.2                67.0
2019-04-09 04:00:00+00:00     34.5     48.5                41.0
2019-04-09 05:00:00+00:00     46.5     59.5                41.0

### Pivot table
---
`pivot` 메서드가 단순히 데이터의 형태만 바꿔주는 반면에  
`pivot_table` 은 집계기능까지 가능하다!

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/07_pivot_table.svg)

각 `location` 별 `parameter` 의 `value` 평균을 구하면?

In [45]:
air_quality_long.pivot_table(values="value", index="location", columns="parameter", aggfunc="mean")

parameter                 no2       pm25
location
BETR801             26.950920  23.169492
FR04014             29.374284        NaN
London Westminster  29.740050  13.443568

`pivot_table` 을 사용하지 않고도 같은 결과를 알 수 있다.  
다만 시인성이 조금 떨어질 뿐이다.

In [46]:
air_quality_long.groupby(["location", "parameter"]).mean()

                                  value
location           parameter
BETR801            no2        26.950920
                   pm25       23.169492
FR04014            no2        29.374284
London Westminster no2        29.740050
                   pm25       13.443568

### Wide to long format
---
가로로 긴(`wide`) 형태에서 세로로 긴(`long`) 형태로 변환!

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/07_melt1.svg)

In [47]:
no2_pivoted = no2.pivot(columns="location", values="value")

no2_pivoted.head()

location                   BETR801  FR04014  London Westminster
date.utc
2019-04-09 01:00:00+00:00     22.5     24.4                 NaN
2019-04-09 02:00:00+00:00     53.5     27.4                67.0
2019-04-09 03:00:00+00:00     54.5     34.2                67.0
2019-04-09 04:00:00+00:00     34.5     48.5                41.0
2019-04-09 05:00:00+00:00     46.5     59.5                41.0

현재 인덱스로 쓰이는 `date.utc` 를 일반 컬럼으로 들고오기위해 `reset_index` 함수 사용

In [48]:
no2_pivoted = no2_pivoted.reset_index()

no2_pivoted.head()

location                  date.utc  BETR801  FR04014  London Westminster
0        2019-04-09 01:00:00+00:00     22.5     24.4                 NaN
1        2019-04-09 02:00:00+00:00     53.5     27.4                67.0
2        2019-04-09 03:00:00+00:00     54.5     34.2                67.0
3        2019-04-09 04:00:00+00:00     34.5     48.5                41.0
4        2019-04-09 05:00:00+00:00     46.5     59.5                41.0

`pivot` 형태로 열로 쌓여있는 데이터를 행으로 쌓아보자! (with `melt`)

In [49]:
no2_pivoted.melt(id_vars="date.utc").head(10)

                   date.utc location  value
0 2019-04-09 01:00:00+00:00  BETR801   22.5
1 2019-04-09 02:00:00+00:00  BETR801   53.5
2 2019-04-09 03:00:00+00:00  BETR801   54.5
3 2019-04-09 04:00:00+00:00  BETR801   34.5
4 2019-04-09 05:00:00+00:00  BETR801   46.5
5 2019-04-09 06:00:00+00:00  BETR801   50.0
6 2019-04-09 07:00:00+00:00  BETR801   38.5
7 2019-04-09 08:00:00+00:00  BETR801   39.0
8 2019-04-09 09:00:00+00:00  BETR801   35.0
9 2019-04-09 10:00:00+00:00  BETR801   33.5

# How to combine data from multiple tables?
---
여러개의 데이터셋(`DataFrame`)을 하나로 합쳐보자.

### Concatenating objects
---
여러 `DataFrame` 을 연결(`concatenate`) 하는 방법!

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/08_concat_row1.svg)

각 도시별 no2(이산화질소) 의 측정값을 가지는 데이터셋을 불러온다.

In [50]:
air_quality_no2 = pd.read_csv(
    "https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/air_quality_no2_long.csv",
    parse_dates=True,
    usecols=["date.utc", "location", "parameter", "value"]
)

air_quality_no2.head()

                    date.utc location parameter  value
0  2019-06-21 00:00:00+00:00  FR04014       no2   20.0
1  2019-06-20 23:00:00+00:00  FR04014       no2   21.8
2  2019-06-20 22:00:00+00:00  FR04014       no2   26.5
3  2019-06-20 21:00:00+00:00  FR04014       no2   24.9
4  2019-06-20 20:00:00+00:00  FR04014       no2   21.4

In [51]:
air_quality_no2.shape  # 2068행, 4열

(2068, 4)

각 도시별 pm25(미세먼지, particular matter) 의 측정값을 가지는 데이터셋을 불러온다.

In [52]:
air_quality_pm25 = pd.read_csv(
    "https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/air_quality_pm25_long.csv",
    parse_dates=True,
    usecols=["date.utc", "location", "parameter", "value"]
)

air_quality_pm25.head()

                    date.utc location parameter  value
0  2019-06-18 06:00:00+00:00  BETR801      pm25   18.0
1  2019-06-17 08:00:00+00:00  BETR801      pm25    6.5
2  2019-06-17 07:00:00+00:00  BETR801      pm25   18.5
3  2019-06-17 06:00:00+00:00  BETR801      pm25   16.0
4  2019-06-17 05:00:00+00:00  BETR801      pm25    7.5

In [53]:
air_quality_pm25.shape  # 1110행, 4열

(1110, 4)

`concat` 메서드를 활용하여 각 도시별 no2(이산화질소)와 pm25(미세먼지) `DataFrame` 을 합친다.

In [54]:
air_quality = pd.concat([air_quality_no2, air_quality_pm25])

In [55]:
air_quality.shape  # 2268행 + 1110행 = 3178행, 4열

(3178, 4)

In [56]:
air_quality.head()

                    date.utc location parameter  value
0  2019-06-21 00:00:00+00:00  FR04014       no2   20.0
1  2019-06-20 23:00:00+00:00  FR04014       no2   21.8
2  2019-06-20 22:00:00+00:00  FR04014       no2   26.5
3  2019-06-20 21:00:00+00:00  FR04014       no2   24.9
4  2019-06-20 20:00:00+00:00  FR04014       no2   21.4

### Join tables using a common identifier
---
공통 식별자(`key`)를 이용하여 `DataFrame` 을 `Join` 해보자

![](https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/08_merge_left.svg)

도시별 측정 위치정보(위도, 경도)를 불러온다.  
`location` 을 `key` 로 사용할 건데, 중복이 없다고 가정하여 `drop_duplicates` 메서드로 `location` 열을 유일한 값으로 만든다.

In [57]:
stations = pd.read_csv(
    "https://gist.githubusercontent.com/pparkddo/820d50241a31d29f8cce8f6f33b6ad8b/raw/8488d152525893d6e6c6cb7ceeff6c45764bb081/air_quality_stations.csv"
).drop_duplicates("location")

stations.head()

  location  coordinates.latitude  coordinates.longitude
0  BELAL01              51.23619                4.38522
1  BELHB23              51.17030                4.34100
2  BELLD01              51.10998                5.00486
3  BELLD02              51.12038                5.02155
4  BELR833              51.32766                4.36226

`merge` 메서드를 활용하여 도시별 측정값과 해당 도시의 측정 위치정보를 `Join`한다.

In [58]:
pd.merge(air_quality, stations, how="left", on="location").head()

,date.utc,location,parameter,value,coordinates.latitude,coordinates.longitude
0,2019-06-21 00:00:00+00:00,FR04014,no2,20.0,48.83724,2.3939
1,2019-06-20 23:00:00+00:00,FR04014,no2,21.8,48.83724,2.3939
2,2019-06-20 22:00:00+00:00,FR04014,no2,26.5,48.83724,2.3939
3,2019-06-20 21:00:00+00:00,FR04014,no2,24.9,48.83724,2.3939
4,2019-06-20 20:00:00+00:00,FR04014,no2,21.4,48.83724,2.3939

# How to handle time series data with ease?
---
어떻게 하면 시계열(`time series`)데이터를 손쉽게 다룰 수 있을까?

### Using pandas datetime properties
---
pandas 의 `datetime` 속성을 이용하자!  
`to_datetime` 메서드를 사용해서 일반 컬럼을 `datetime` `dtype` 으로 변경시킨다.

In [59]:
air_quality["date.utc"] = pd.to_datetime(air_quality["date.utc"])

`date.utc` 열 중 가장 이전의 값(`min`)과 가장 최근 값(`max`) 을 계산한다.

In [60]:
air_quality["date.utc"].min(), air_quality["date.utc"].max()

(Timestamp('2019-05-07 01:00:00+0000', tz='UTC'),
 Timestamp('2019-06-21 00:00:00+0000', tz='UTC'))

`pandas.Timestamp` 는 날짜계산과 관련된 여러가지 연산을 제공한다.  
예를 들어 시계열의 기간(`min`~`max`)을 알아보자.

In [61]:
air_quality["date.utc"].max() - air_quality["date.utc"].min()

Timedelta('44 days 23:00:00')

해당 일시의 정보를 속성 접근으로 알아낼 수 있다.  
그러려면 아래 조건을 만족시키면 된다.  
1. 해당 열이 `datetime` 형식이어야 하고
2. `.dt` 속성접근자를 사용

`datetime` 열에서 월(`month`) 정보를 추출한다.

In [62]:
air_quality["date.utc"].dt.month.head(10)

0    6
1    6
2    6
3    6
4    6
5    6
6    6
7    6
8    6
9    6
Name: date.utc, dtype: int64

`datetime` 열에서 시간(`hour`) 정보를 추출한다.

In [63]:
air_quality["date.utc"].dt.hour.head(10)

0     0
1    23
2    22
3    21
4    20
5    19
6    18
7    17
8    16
9    15
Name: date.utc, dtype: int64

### Resample a time series to another frequency
---
시계열의 표본단위(시간단위, 일단위, 월단위 등)를 다른 단위로 변경해보자.

우선 resample 함수를 이용하기 위해서는 해당 열이 `index` 여야 하므로  
`set_index` 메서드를 사용해서 `index` 로 만들어 준다.

In [64]:
air_quality = air_quality.set_index("date.utc")

일별(`d`) 최대(`max`) `value` 값으로 `resample` 한다.

In [65]:
air_quality.resample("d").max().head(10)

                                     location parameter  value
date.utc
2019-05-07 00:00:00+00:00  London Westminster      pm25   77.7
2019-05-08 00:00:00+00:00  London Westminster      pm25   48.9
2019-05-09 00:00:00+00:00  London Westminster      pm25   97.0
2019-05-10 00:00:00+00:00  London Westminster      pm25   60.7
2019-05-11 00:00:00+00:00  London Westminster      pm25   37.0
2019-05-12 00:00:00+00:00  London Westminster      pm25   46.5
2019-05-13 00:00:00+00:00  London Westminster      pm25   45.2
2019-05-14 00:00:00+00:00  London Westminster      pm25   46.1
2019-05-15 00:00:00+00:00  London Westminster      pm25   48.1
2019-05-16 00:00:00+00:00  London Westminster      pm25   52.6

# How to manipulate textual data?
---
이제는 `문자열`(`str`) 데이터 조작을 정복해보자!

`.str` 접근자와 `lower` 메서드를 이용하여 모든 이름을 소문자로 변경해보자.

In [66]:
titanic["Name"].str.lower().head(10)

0                              braund, mr. owen harris
1    cumings, mrs. john bradley (florence briggs th...
2                               heikkinen, miss. laina
3         futrelle, mrs. jacques heath (lily may peel)
4                             allen, mr. william henry
5                                            anonymous
6                              mccarthy, mr. timothy j
7                       palsson, master. gosta leonard
8    johnson, mrs. oscar w (elisabeth vilhelmina berg)
9                  nasser, mrs. nicholas (adele achem)
Name: Name, dtype: object

이름의 가장 첫번째 단어(`comma(,)` 기준)을 추출해서 `SurName`(성) 필드를 만들어보자.

`split` 메서드를 이용하여 우선 `comma(,)` 기준 으로 이름을 나눈다.  
분리하면 `comma(,)` 로 나누어진 문자열 리스트를 가진 `Series`가 반환된다.

In [67]:
titanic["Name"].str.split(",").head(10)

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
5                                          [anonymous]
6                           [McCarthy,  Mr. Timothy J]
7                    [Palsson,  Master. Gosta Leonard]
8    [Johnson,  Mrs. Oscar W (Elisabeth Vilhelmina ...
9               [Nasser,  Mrs. Nicholas (Adele Achem)]
Name: Name, dtype: object

그 상태에서 `get` 메서드를 이용해서 가장 첫번째 인덱스(`0번`)의 값을 들고온 후,  
`SurName` 열에 대입한다.

In [68]:
titanic["SurName"] = titanic["Name"].str.split(",").str.get(0)

titanic["SurName"].head(10)

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
5    anonymous
6     McCarthy
7      Palsson
8      Johnson
9       Nasser
Name: SurName, dtype: object

이름(`Name`) 중 James 를 가진 승객을 필터링 해보자.

In [69]:
titanic[titanic["Name"].str.contains("James")].head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SurName
67,68,0,3,"Crease, Mr. Ernest James",male,19.0,0,0,S.P. 3464,8.1583,NaN,S,Crease
134,135,0,2,"Sobey, Mr. Samuel James Hayden",male,25.0,0,0,C.A. 29178,13.0000,NaN,S,Sobey
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S,Bateman
161,162,1,2,"Watt, Mrs. James (Elizabeth ""Bessie"" Inglis Mi...",female,40.0,0,0,C.A. 33595,15.7500,NaN,S,Watt
174,175,0,1,"Smith, Mr. James Clinch",male,56.0,0,0,17764,30.6958,A7,C,Smith
194,195,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,0,PC 17610,27.7208,B4,C,Brown
221,222,0,2,"Bracken, Mr. James H",male,27.0,0,0,220367,13.0000,NaN,S,Bracken
299,300,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,Baxter
416,417,1,2,"Drew, Mrs. James Vivian (Lulu Thorne Christian)",female,34.0,1,1,28220,32.5000,NaN,S,Drew
512,513,1,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S,McGough

가장 긴 이름(`Name`)을 가진 승객은 ?

In [70]:
titanic.loc[titanic["Name"].str.len().idxmax(), "Name"]

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'